app/Controllers/Hadiah.php

SELECT *
FROM `tbl_hadiah`
---
    public function index()
    {
        $data = [
            'judul' => 'Membership',
            'subjudul' => 'Hadiah',
            'menu' => 'membership',
            'submenu' => 'hadiah',
            'page' => 'member/v_hadiah',
            'hadiah' => $this->ModelHadiah->findAll()