app/Controllers/Member.php

    public function index()
    {
        $data = [
            'judul' => 'Membership',
            'subjudul' => 'Member',
            'menu' => 'membership',
            'submenu' => 'member',
            'page' => 'member/v_member',
            'member' => $this->ModelMember->findAll(),
---
SELECT *
FROM `tbl_member`