app/Controllers/Poin.php

SELECT *
FROM `tbl_member`
---
    public function index()
    {
        $data = [
            'judul' => 'Membership',
            'subjudul' => 'Poin',
            'menu' => 'membership',
            'submenu' => 'poin',
            'page' => 'member/v_poin',
            'poin' => $this->ModelPoin->GetAllWithMember(),
            'member' => $this->ModelMember->findAll()