app/Controllers/TukarPoin.php

    public function index()
    {
        $data = [
            'judul' => 'Membership',
            'subjudul' => 'Penukaran Poin',
            'menu' => 'membership',
            'submenu' => 'tukarpoin',
            'page' => 'member/v_tukar_poin',
            'tukar' => $this->ModelTukarPoin->findAll(),
---
SELECT *
FROM `tbl_tukar_poin`