app/Models/ModelPoin.php

    public function GetAllWithMember()
    {
        return $this->db->table('tbl_histori_poin')
            ->join('tbl_member', 'tbl_member.kode_member = tbl_histori_poin.id_member', 'left')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_histori_poin`
LEFT JOIN `tbl_member` ON `tbl_member`.`kode_member` = `tbl_histori_poin`.`id_member`
SELECT *
FROM `tbl_poin`
LEFT JOIN `tbl_member` ON `tbl_member`.`id_member` = `tbl_poin`.`id_member`