app/Models/ModelAdmin.php

SELECT *
FROM `tbl_setting`
WHERE `id` = '1'
---
    public function DetailData()
    {
        return $this->db->table('tbl_setting')
            ->where('id', '1')
            ->get()
            ->getRowArray();

SELECT `tbl_transaksi`.`tgl_jual`, SUM(`tbl_rinci_transaksi`.`total_harga`) AS `total_harga`, SUM(`tbl_rinci_transaksi`.`untung`) AS `untung`
FROM `tbl_rinci_transaksi`
JOIN `tbl_transaksi` ON `tbl_transaksi`.`no_faktur`=`tbl_rinci_transaksi`.`no_faktur`
WHERE month(tbl_transaksi.tgl_jual) = '07'
AND year(tbl_transaksi.tgl_jual) = '2025'
GROUP BY `tbl_transaksi`.`tgl_jual`
---
    public function Grafik()
    {
        return $this->db->table('tbl_rinci_transaksi')
            ->join('tbl_transaksi', 'tbl_transaksi.no_faktur=tbl_rinci_transaksi.no_faktur')
            ->where('month(tbl_transaksi.tgl_jual)', date('m'))
            ->where('year(tbl_transaksi.tgl_jual)', date('Y'))
            ->select('tbl_transaksi.tgl_jual')
            ->groupBy('tbl_transaksi.tgl_jual')
            ->selectSum('tbl_rinci_transaksi.total_harga')
            ->selectSum('tbl_rinci_transaksi.untung')
            ->get()->getResultArray();

SELECT SUM(`tbl_rinci_transaksi`.`total_harga`) AS `total_harga`
FROM `tbl_rinci_transaksi`
JOIN `tbl_transaksi` ON `tbl_transaksi`.`no_faktur`=`tbl_rinci_transaksi`.`no_faktur`
WHERE `tbl_transaksi`.`tgl_jual` = '2025-07-06'
GROUP BY `tbl_transaksi`.`tgl_jual`
---
    public function PendapatanHariIni()
    {
        return $this->db->table('tbl_rinci_transaksi')
            ->join('tbl_transaksi', 'tbl_transaksi.no_faktur=tbl_rinci_transaksi.no_faktur')
            ->where('tbl_transaksi.tgl_jual', date('Y-m-d'))
            ->groupBy('tbl_transaksi.tgl_jual')
            ->selectSum('tbl_rinci_transaksi.total_harga')
            ->get()->getRowArray();

SELECT SUM(`tbl_rinci_transaksi`.`total_harga`) AS `total_harga`
FROM `tbl_rinci_transaksi`
JOIN `tbl_transaksi` ON `tbl_transaksi`.`no_faktur`=`tbl_rinci_transaksi`.`no_faktur`
WHERE month(tbl_transaksi.tgl_jual) = '07'
AND year(tbl_transaksi.tgl_jual) = '2025'
GROUP BY month(tbl_transaksi.tgl_jual)
---
    public function PendapatanBulanIni()
    {
        return $this->db->table('tbl_rinci_transaksi')
            ->join('tbl_transaksi', 'tbl_transaksi.no_faktur=tbl_rinci_transaksi.no_faktur')
            ->where('month(tbl_transaksi.tgl_jual)', date('m'))
            ->where('year(tbl_transaksi.tgl_jual)', date('Y'))
            ->groupBy('month(tbl_transaksi.tgl_jual)')
            ->selectSum('tbl_rinci_transaksi.total_harga')
            ->get()->getRowArray();

SELECT SUM(`tbl_rinci_transaksi`.`total_harga`) AS `total_harga`
FROM `tbl_rinci_transaksi`
JOIN `tbl_transaksi` ON `tbl_transaksi`.`no_faktur`=`tbl_rinci_transaksi`.`no_faktur`
WHERE year(tbl_transaksi.tgl_jual) = '2025'
GROUP BY year(tbl_transaksi.tgl_jual)
---
    public function PendapatanTahunIni()
    {
        return $this->db->table('tbl_rinci_transaksi')
            ->join('tbl_transaksi', 'tbl_transaksi.no_faktur=tbl_rinci_transaksi.no_faktur')
            ->where('year(tbl_transaksi.tgl_jual)', date('Y'))
            ->groupBy('year(tbl_transaksi.tgl_jual)')
            ->selectSum('tbl_rinci_transaksi.total_harga')
            ->get()->getRowArray();

SELECT COUNT(*) AS `numrows` FROM `tbl_produk`
---
    public function JumlahProduk()
    {
        return $this->db->table('tbl_produk')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_kategori`
---
    public function JumlahKategori()
    {
        return $this->db->table('tbl_kategori')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_satuan`
---
    public function JumlahSatuan()
    {
        return $this->db->table('tbl_satuan')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_user`
---
    public function JumlahUser()
    {
        return $this->db->table('tbl_user')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_member`
---
    public function JumlahMember()
    {
        return $this->db->table('tbl_member')->countAll();