app/Models/ModelTransaksi.php

SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
WHERE `kode_produk` = '5555'
---
    public function CekProduk($kode_produk)
    {
        return $this->db->table('tbl_produk')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_produk.id_kategori')
            ->join('tbl_satuan', 'tbl_satuan.id_satuan=tbl_produk.id_satuan')
            ->where('kode_produk', $kode_produk)
            ->get()
            ->getRowArray();

SELECT *
FROM `tbl_member`
WHERE `kode_member` = '0008'
---
    public function CekMember($kode_member)
    {
        return $this->db->table('tbl_member')
            ->where('kode_member', $kode_member)
            ->get()
            ->getRowArray();

SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
WHERE `stok` > 0
---
    public function AllProduk()
    {
        return $this->db->table('tbl_produk')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_produk.id_kategori')
            ->join('tbl_satuan', 'tbl_satuan.id_satuan=tbl_produk.id_satuan')
            ->where('stok > 0')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_member`
---
    public function AllMember()
    {
        return $this->db->table('tbl_member')
            ->get()
            ->getResultArray();

SELECT `total_poin`, `id_member`
FROM `tbl_member`
WHERE `kode_member` = '0008'
---
    public function getTotalPoinByKodeMember($kode_member)
    {
        return $this->db->table('tbl_member')
            ->select('total_poin, id_member')
            ->where('kode_member', $kode_member)
            ->get()
            ->getRow();

INSERT INTO `tbl_transaksi` (`no_faktur`, `tgl_jual`, `jam`, `grand_total`, `dibayar`, `kembalian`, `id_user`, `kode_member`, `poin`) VALUES ('202507120003', '2025-07-12', '21:13:43', 10000, '10000', '-9000', '3', '0008', 1)
---
    public function InsertTransaksi($data)
    {
        $this->db->table('tbl_transaksi')->insert($data);

INSERT INTO `tbl_histori_poin` (`total_poin_histori`, `id_member`, `poin_didapat`) VALUES ('4', '0008', 1)
---
    public function InsertHistoriPoin($poin)
    {
        $this->db->table('tbl_histori_poin')->insert($poin);

INSERT INTO `tbl_rinci_transaksi` (`no_faktur`, `kode_produk`, `harga`, `modal`, `qty`, `total_harga`, `untung`) VALUES ('202507120003', '5555', 10000, '7000', 1, 10000, 3000)
---
    public function InsertRinciTransaksi($data)
    {

        $this->db->table('tbl_rinci_transaksi')->insert($data);

UPDATE `tbl_member` SET `total_poin` = total_poin + 1
WHERE `kode_member` = '0008'
---
    public function updatepoin($poin, $kode_member)
    {
        $this->db->table('tbl_member')
            ->where('kode_member', $kode_member)
            ->set('total_poin', 'total_poin + ' . $poin, false)
            ->update();

SELECT `tbl_transaksi`.*, `tbl_user`.`nama_user`, `tbl_member`.`nama_member`, `tbl_member`.`alamat`
FROM `tbl_transaksi`
LEFT JOIN `tbl_user` ON `tbl_user`.`id_user` = `tbl_transaksi`.`id_user`
LEFT JOIN `tbl_member` ON `tbl_member`.`kode_member` = `tbl_transaksi`.`kode_member`
WHERE `tbl_transaksi`.`no_faktur` = '202507120003'
---
    public function GetTransaksiByNoFaktur($no_faktur)
    {
        return $this->db->table('tbl_transaksi')
            ->select('tbl_transaksi.*, tbl_user.nama_user, tbl_member.nama_member, tbl_member.alamat')
            ->join('tbl_user', 'tbl_user.id_user = tbl_transaksi.id_user', 'left')
            ->join('tbl_member', 'tbl_member.kode_member = tbl_transaksi.kode_member', 'left')
            ->where('tbl_transaksi.no_faktur', $no_faktur)
            ->get()
            ->getRowArray();

SELECT `tbl_rinci_transaksi`.*, `tbl_produk`.`nama_produk`, `tbl_kategori`.`nama_kategori`, `tbl_satuan`.`nama_satuan`
FROM `tbl_rinci_transaksi`
LEFT JOIN `tbl_produk` ON `tbl_produk`.`kode_produk` = `tbl_rinci_transaksi`.`kode_produk`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_produk`.`id_kategori`
LEFT JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan` = `tbl_produk`.`id_satuan`
WHERE `tbl_rinci_transaksi`.`no_faktur` = '202507120003'
---
    public function GetDetailTransaksiByNoFaktur($no_faktur)
    {
        return $this->db->table('tbl_rinci_transaksi')
            ->select('tbl_rinci_transaksi.*, tbl_produk.nama_produk, tbl_kategori.nama_kategori, tbl_satuan.nama_satuan')
            ->join('tbl_produk', 'tbl_produk.kode_produk = tbl_rinci_transaksi.kode_produk', 'left')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_produk.id_kategori', 'left')
            ->join('tbl_satuan', 'tbl_satuan.id_satuan = tbl_produk.id_satuan', 'left')
            ->where('tbl_rinci_transaksi.no_faktur', $no_faktur)
            ->get()
            ->getResultArray();